<div class="col-xs-12">
    <h3 class="post-title">آمار بالای نارسایی کلیه در کشور/ دستگاه‌های دیالیز فرسوده‌اند</h3>
    <img class="post-cover" src=" {{ url('photos/shares/login-background.jpg') }}" alt="">
    <p>
        دوست گرامی، ارائه اطلاعات صحیح به دیگران درزمینه مبحث مقدس اهدای عضو از افراد مرگ مغزی
        می‌تواند باعث اشاعه این فرهنگ، بالا بردن اطلاعات جامعه، افزایش آمار رضایت خانواده‌های افراد
        مرگ
        مغزی به اهدای اعضای عزیزانشان و درنتیجه نجات جان انسان‌های بیشتری گردد.
    </p>
    <p>
        از طرف دیگر ارائه اطلاعات غلط به جامعه توسط یک سفیر اهدای عضو - به‌عنوان نماینده انجمن اهدای
        عضو- می‌تواند با ضربه به این فرهنگ نوپا باعث عدم اعتماد مردم، کاهش رضایت به اهدای عضو و
        درنتیجه
        مرگ تعداد بیشتری از بیماران لیست انتظار پیوند اعضا شود.
    </p>
    <p>
        به همین دلیل لازم است یک سفیر اهدای عضو اطلاعات کامل و جامعی از مباحث مربوطه داشته و
        به‌عنوان
        منبع موثق اطلاعات اهدای عضو در جامعه، یاری‌دهنده بیماران نیازمند به پیوند باشد؛ از طرفی
        درصورتی‌که
        شما یکی از هنرمندان، ورزشکاران یا افراد سرشناس جامعه هستید، درک صحیح شما از مسئله اهدای عضو
        می‌تواند باعث شود با آثار و سخنان خود، راه صحیح را به علاقه‌مندان به آثار یا شخصیتتان نشان
        دهید و
    </p>
</div>

{!! $externalBlade or '' !!}

{{-- best command for real post --}}
{{--<small>{{ trans('validation.attributes.publish_date') }}: {{ $post->say('published_at') }}</small>--}}
<small>{{ trans('validation.attributes.publish_date') }}: {{ echoDate(\Carbon\Carbon::now()) }}</small>