<?php
return [
    'black'      => "مشکی",
    'gray'       => "خاکستری",
    'grey'       => "خاکستری",
    'white'      => "سفید",
    'orange'     => "نارنجی",
    'yellow'     => "زرد",
    'green'      => "سبز",
    'blue'       => "آبی",
    'purple'     => "بنفش روشن",
    'brown'      => "قهوه‌ای",
    'magenta'    => "ارغوانی",
    'tan'        => "قهوه‌ای مایل به زرد",
    'cyan'       => "فیروزه‌ای",
    'olive'      => "زیتونی",
    'maroon'     => "خرمایی",
    'aquamarine' => "زمرد کبود",
    'silver'     => "نقره‌ای",
    'teal'       => "نیلی",
    'violet'     => "بنفش تیره",
    'pink'       => "صورتی",
    'red'        => "قرمز",
];


