<?php //@TODO: NEW

return [
	'cards' => [
		'create'               => "افزودن کارت تازه",
		'edit'                 => "ویرایش کارت اهدای عضو",
		'browse'               => "نمایش کارت‌ها",
		'print'                => "چاپ کارت",
		'register'             => "ثبت نام",
		'inquiry'              => "استعلام کارت اهدا",
		'inquiry_success'      => 'ادامه‌ی فرم را تکمیل کنید.',
		'inquiry_has_card'     => 'کارت اهدای عضو برای این شماره‌ی ملی موجود است.',
		'inquiry_is_volunteer' => 'این شماره‌ی ملی، برای یکی از سفیران اهدای عضو ثبت شده است.',
		'send_to_print_quee'   => "ارسال به صف چاپ",
		'save_and_send_to_print' => 'ذخیره  و ارسال به صف چاپ فیزیکی کارت',
		'event_hint_for_card_edits'   => "اگر کارت را به صف چاپ فیزیکی می‌فرستید، می‌توانید رویداد را انتخاب کنید. در غیر این صورت انتخاب رویداد تأثیری ندارد.",
	],

	'from_domain'           => "از دامنه‌ی",
	'donation_card'         => "کارت اهدای عضو",
	'donation_cards'        => "کارت‌های اهدای عضو",
	'volunteer'             => "سفیر اهدای عضو",
	'volunteers'            => "سفیران اهدای عضو",
	'newsletter'            => "خبرنامه‌ی ایمیلی سامانه‌ی اهدای عضو",
	'newsletter_membership' => "عضویت در خبرنامه‌ی ایمیلی سامانه‌ی اهدای عضو",
];