<?php
return [
    'dashboard'              => "پیشخوان",
    'logout'                 => "خروج",
    'grid_count'             => 'در حال نمایش :rows سطر از مجموع :total سطر موجود اطلاعات',
    'manage'                 => 'مدیریت',
    'session_expired_notice' => "به دلیل وقفه طولانی در کار، از سیستم خارج شده‌اید. با ورود مجدد در صفحه‌ای تازه، می‌توانید به کار خود در همین صفحه ادامه دهید.",
    'login_again'            => "لازم است دوباره وارد شوید!",
    'global'                 => "سراسری",
    'search-people'          => "آدم‌یاب",
    'people_submissions'     => "ارسالی کاربران",

	'tabs' => [
		'actives'   => "فعال‌ها",
		'inactives' => "غیرفعال‌ها",
		'blockeds'  => "مسدودشده‌ها",
		'deleteds'  => "حذف‌شده‌ها",
		'bin'       => "زباله‌دان",
	],

	'modules' => [
		'other_modules' => "سایر ماژول‌ها",
		'posts'         => "مدیریت محتوا",
		'users'         => "کاربران مجموعه",
		'carts'         => "سبدهای خرید",
		'receipts'      => "رسیدهای خرید",
		'files'         => "مدیرفایل",
		'comments'      => "دیدگاه‌ها",
	],

	'permissions' => [
		'*'            => "کنترل کامل",
		'create'       => "افزودن",
		'edit'         => "ویرایش",
		'publish'      => "انتشار",
		'activate'     => "فعال‌سازی",
		'report'       => "گزارش",
		'delete'       => "حذف",
		'bin'          => "زباله‌دان",
		'block'        => "مسدودسازی",
		'category'     => "دسته‌بندی",
		'browse'       => "پیمایش",
		'process'      => "اقدام",
		'view'         => "نمایش",
		'send'         => "ارسال ایمیل/پیامک",
		'search'       => "جست‌وجو",
		'print'        => "چاپ",
		'print-direct' => "چاپ مستقیم",
		'print-excel'  => "چاپ اکسل",
		'settings'     => "تنظیمات",
		'permit'       => "تعیین سطح دسترسی",

	],


];