<?php
return [

	'commands' => [
		'permit' => "تنظیم سطح دسترسی",
		'change_password' => "تغییر گذرواژه",
		'block' => "مسدودسازی",
		'unblock' => "رفع مسدودی",
		'login_as' => "لاگین به جای ایشان",
	],

	'admins' => [
		'title' => "مدیران مجموعه",
		'create' => "افزون مدیر جدید",
		'super_admin' => "مدیر کل",
		'ordinary_admin' => "مدیر عملیات",
		'developer' => "برنامه‌نویس",
	],

	"form" => [
			"deleted_person" => '[؟]' ,
			"notify-with-email" => 'به کاربر از طریق ایمیل اطلاع‌رسانی شود.' ,
			"notify-with-sms" => 'به کاربر از طریق پیامک اطلاع‌رسانی شود.' ,
			"notify" => 'به کاربر از طریق پیامک و ایمیل اطلاع‌رسانی شود.' ,
			"will-be-notified" => 'به کاربر از طریق پیامک و ایمیل اطلاع‌رسانی می‌شود.' ,
			"default_password" => 'شماره‌ی تلفن همراه به عنوان گذرواژه در نظر گرفته می‌شود و کاربر در اولین ورود ملزم به تغییر خواهد بود.' ,
			"hard_delete_notice" => 'این حذف غیر قابل بازگشت خواهد بود.' ,
			"password_hint" => 'حداقل هشت کاراکتر حساس به کوچکی و بزرگی حروف. تمام ارقام به انگلیسی تبدیل می‌شوند.' ,
	],
];