<?php
return [
	'types' => [
		'meta_hint' => 'متاها را به صورت key:type بنویسید و با کامای انگلیسی (,) از هم جدا کنید. اگر نوع مشخص نشود، text در نظر گرفته می‌شود. نوع‌های مجاز: ',
		'delete_alert_posts' => 'اصلاً به سرنوشت :count پستی که به این شاخه تعلق دارد فکر کرده‌ای عزیز جان؟',
		'delete_alert' => 'این حذف به شیوه‌ی نرم انجام می‌شود، اما در داخل برنامه راهی برای بازیافت وجود ندارد.' ,
	],

	'features' => [
		'meaning' => "ویژگی‌ها" ,
		'slug' => "تنظیم نامک",
		'download' => "دانلود فایل",
		'abstract' => "چکیده",
		'title' => "عنوان",
		'title2' => "عنوان دوم",
		'seo' => "بررسی‌های سئو",
		'long_title' => "عنوان خیلی طولانی",
		'text' => "متن",
		'image' => "تصویر برگزیده",
		'rss' => "آراس‌اس",
		'price' => "فیلد قیمت",
		'basket' => "سبد خرید",
		'comment' => "پذیرش دیدگاه",
		'rate' => "پذیرش بازخورد",
		'album' => "ایجاد آلبوم عکس",
		'category' => "دسته‌بندی",
		'searchable' => "قابل جست‌وجو",
		'preview' => "پیش‌نمایش در حین ایجاد",
		'digest' => "نمایش در پیشخوان",
		'schedule' => "تنظیم زمان انتشار",
		'keywords' => "کلیدواژه",
		'register' => "ثبت نام اشخاص",
		'visibility_choice' => "امکان انتخاب رؤیت‌پذیری",
		'template_choice' => "امکان انتخاب قالب",
		'developers_only' => "انحصاری برنامه‌نویسان",
	],

	'templates' => [
		'post' => "مطلب" ,
		'album' => "آلبوم",
		'slideshow' => "اسلایدشو",
		'dialogue' => "گفت‌وگو",
		'faq' => "پرسش و پاسخ",
		'product' => "محصول فروشگاهی",
	],

	'categories' => [
		'meaning' => "دسته‌بندی‌ها" ,
	],

	'criteria' => [
		'all' => "همه" ,
		'published' => "منتشرشده‌ها",
		'scheduled' => "صف انتشار",
		'pending' => "منتظر تأیید",
		'drafts' => "پیش‌نویس‌ها",
		'my_posts' => "نوشته‌های من",
		'my_drafts' => "پیش‌نویس‌های من",
		'bin' => "زباله‌دان",
	],

	'form' => [
		'title_placeholder' => "عنوان را اینجا وارد کنید" ,
		'title2_placeholder' => "عنوان دوم را در صورت نیاز اینجا وارد کنید",
		'add_second_title' => "افزودن عنوان دوم",
	],
];