<?php
return [
	'types' => [
		'meta_hint' => 'متاها را به صورت key:type بنویسید و با کامای انگلیسی (,) از هم جدا کنید. اگر نوع مشخص نشود، text در نظر گرفته می‌شود. نوع‌های مجاز: ',
		'delete_alert_posts' => 'اصلاً به سرنوشت :count پستی که به این شاخه تعلق دارد فکر کرده‌ای عزیز جان؟',
		'delete_alert' => 'این حذف به شیوه‌ی نرم انجام می‌شود، اما در داخل برنامه راهی برای بازیافت وجود ندارد.' ,
	],

	'features' => [
		'meaning' => "ویژگی‌ها" ,
		'title' => "عنوان",
		'text' => "متن",
		'image' => "تصویر برگزیده",
		'rss' => "آراس‌اس",
		'comment' => "پذیرش دیدگاه",
		'rate' => "پذیرش بازخورد",
		'album' => "ایجاد آلبوم عکس",
		'category' => "دسته‌بندی",
		'searchable' => "قابل جست‌وجو",
		'preview' => "پیش‌نمایش در حین ایجاد",
		'digest' => "نمایش در پیشخوان",
		'schedule' => "تنظیم زمان انتشار",
		'keywords' => "کلیدواژه",
		'register' => "ثبت نام اشخاص",
		'visibility_choice' => "امکان انتخاب رؤیت‌پذیری",
		'template_choice' => "امکان انتخاب قالب",
		'developers_only' => "انحصاری برنامه‌نویسان",
	],

	'templates' => [
		'post' => "مطلب" ,
		'album' => "آلبوم",
		'slideshow' => "اسلایدشو",
		'dialogue' => "گفت‌وگو",
		'faq' => "پرسش و پاسخ",
	],

	'categories' => [
		'meaning' => "دسته‌بندی‌ها" ,
	],

];