<?php
return [
    'upstream'      => "تنظیمات بالادستی",
    'states'        => "تقسیمات کشوری",
    'posttypes'     => "گونه‌های مطالب",
    'roles'         => "گونه‌های کاربران",
    'supports'      => "تیم‌های پشتیبانی",
    'support'       => "پشتیبانی",
    'site_settings' => "تنظیمات سایت",

    'downstream'      => "پیکربندی",
    'developers_only' => "انحصار برنامه‌نویسان",
    'is_resident'     => "ماندگار در حافظه",
    'is_localized'    => "زبان‌پذیر",

    'domains'     => "دامنه‌ها",
    'domain_edit' => "ویرایش دامنه",
    'domain_new'  => "دامنه‌ی جدید",
    'artisan'     => "آرتیزان",

    'city'                       => "شهر",
    'cities_of'                  => "شهرهای :province",
    'province_edit'              => "ویرایش استان",
    'province_new'               => "ثبت استان جدید",
    'city_edit'                  => "ویرایش شهر",
    'city_new'                   => "ثبت شهر جدید",
    'city_delete_alert'          => 'این حذف به شیوه‌ی نرم انجام می‌شود و موارد استفاده‌شده در بانک اطلاعاتی برنامه، به حال خود رها می‌شوند.',
    'province_cant_delete_alert' => 'در این استان، :count شهر به ثبت رسیده است. پیش از حذف، ابتدا تکلیف آن‌ها را مشخص کنید.',

    'packages'         => "واحدهای اندازه‌گیری",
    'continuous'       => "پیوسته",
    'continuity'       => "پیوستگی",
    'discontinuous'    => "گسسته",
    'save_as_active'   => "ذخیره به حالت فعال",
    'save_as_inactive' => "ذخیره به حالت غیرفعال",

    'categories' => [
        'template' => 'قالب سایت',
        'contact'  => 'راه‌های ارتباطی',
        'socials'  => 'شبکه‌های اجتماعی',
        'database' => 'بستر اطلاعاتی',
        'accounts' => "حساب‌های بانکی",
        'upstream' => "بالادستی",
    ],

    'account' => [
        'title'                                       => "تنظیمات حساب",
        'profile_save'                                => 'ثبت درخواست ذخیره‌ی تغییرات',
        'profile_revert'                              => 'انصراف از تغییرات',
        'profile_save_note'                           => 'درخواست تغییرات ارسال شد و پس از تأیید در پرونده ثبت خواهند شد. تا زمان بررسی، ویرایش مجدد امکان‌پذیر است.',
        'profile_pending_note'                        => 'تغییرات در انتظار تأیید هستند. ویرایش‌های بعدی، درخواست را به‌روز خواهند کرد.',
        'profile_reject_note'                         => 'درخواست تغییرات تأیید نشد! می‌توانید درخواست خود را ویرایش و مجدداً ارسال نمایید.',
        'profile_revert_note'                         => 'تغییرات پاک شدند.',
        'profile_completions_note_for_new_volunteers' => "درخواست شما برای سفیری اهدای عضو، در دست بررسی است. برای این کار به اطلاعات کامل شما نیاز داریم.",
        'in_profile'                                  => 'در پرونده: :v',
    ],

];