<?php
return [
	'upstream' => "تنظیمات بالادستی",
	'account' => "تنظیمات حساب",
	'states' => "تقسیمات کشوری",
	'posttypes' => "گونه‌های مطالب",
	'roles' => "گونه‌های کاربران",

	'downstream' => "تنظیمات پایین‌دستی",
	'developers_only' => "انحصار برنامه‌نویسان",
	'is_resident' => "ماندگار در حافظه",
	'is_localized' => "زبان‌پذیر",

	'city' => "شهر",
	'cities_of' => "شهرهای :province",
	'province_edit' => "ویرایش استان",
	'province_new' => "ثبت استان جدید",
	'city_edit' => "ویرایش شهر",
	'city_new' => "ثبت شهر جدید",
	'city_delete_alert' => 'این حذف به شیوه‌ی نرم انجام می‌شود و موارد استفاده‌شده در بانک اطلاعاتی برنامه، به حال خود رها می‌شوند.' ,
	'province_cant_delete_alert' => 'در این استان، :count شهر به ثبت رسیده است. پیش از حذف، ابتدا تکلیف آن‌ها را مشخص کنید.' ,

	'categories' => [
			'template' => 'قالب سایت' ,
			'contact' => 'راه‌های ارتباطی' ,
			'socials' => 'شبکه‌های اجتماعی' ,
			'database' => 'بستر اطلاعاتی' ,
			'accounts' => "حساب‌های بانکی",
			'upstream' => "بالادستی",
	],
];